#-----------------------------------------------------
#-----------------------------------------------------
#списки (можно делать списки списков, словарей и т.п.)
#-----------------------------------------------------
#-----------------------------------------------------

def SampleLists():
    #-------------------------------------------
    empty_list1 = []           #пустой список
    empty_list2 = list()       #пустой список
    weekdays = ['Monday', 'Tuesday', 'Wensday']
    charlist = list('cat')     #список из символов
    print(charlist)
    print(weekdays[0])         #Monday  - получение элемента по индексу
    print(weekdays[-1])        #Wensday
    print(weekdays.index('Tuesday'))  #1  - получение индекса по элементу
    weekdays[0] = 'Hello!'     #изменение элемента  ['Hello!', 'Tuesday', 'Wensday']
    #-------------------------------------------
    numbers = [0,1,2,3,4,5,6,7,8,9,10]
    print(numbers[0:2])        #[0, 1]
    print(numbers[::2])        #[0, 2, 4, 6, 8, 10] - извлечение с шагом 2
    print(numbers[::-2])       #[10, 8, 6, 4, 2, 0]

    numbers.append(11)         #[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11] - добавление в конец
    print(numbers)
    numbers.insert(3, 99)      #[0, 1, 2, 99, 3, 4, 5, 6, 7, 8, 9, 10, 11]  - вставка по индексу
    print(numbers)

    del numbers[1]             #[0, 2, 99, 3, 4, 5, 6, 7, 8, 9, 10, 11] - удаление по индексу
    print(numbers)
    numbers.remove(8)          #[0, 2, 99, 3, 4, 5, 6, 7, 9, 10, 11] - удаление по значению
    print(numbers)
    #-------------------------------------------
    num1 = [0,1,2]
    num2 = [3,4,5]
    num1.extend(num2);         #[0, 1, 2, 3, 4, 5] -объединение. можно так num1 += num2
    print(num1)
    #-------------------------------------------
    numbFIFO = [1,2,3,4,5]
    first = numbFIFO.pop(0)   #[2, 3, 4, 5] - возвращает и удаляет первый элемент [append() и pop(0) реализуют очередь, а append() и pop() - стек]
    print(first)
    print(numbFIFO)
    last = numbFIFO.pop();    #[2, 3, 4]
    print(last)
    print(numbFIFO)
    #-------------------------------------------
    chars = ['f', 's', 'x', 'j', 'm', 'x', 'u']
    print('s' in chars)       #True   - содержитя ли в списке
    print(len(chars))         #7      - длина
    print(chars.count('x'))   #2      - число включений в список
    chars.sort()              #['f', 'j', 'm', 's', 'u', 'x', 'x']  - сортировка
    print(chars) 
    chars.sort(reverse = True)#['x', 'x', 'u', 's', 'm', 'j', 'f']
    print(chars) 

    qq = '-'.join(chars)
    print(qq)                 #x-x-u-s-m-j-f      - построение строки из списка
    #-------------------------------------------
    #присваивание и копирование списков
    #-------------------------------------------
    a = [1,2,2]
    #так можно копировать списки
    b = a.copy()
    c = list(a)
    d = a[:]


#-----------------------------------------------------
#-----------------------------------------------------
#кортежи - это неизменяемые списки
#-----------------------------------------------------
#-----------------------------------------------------
def SampleTuple():
    tuple0 = ()                                #пустой кортеж
    tuple1 = ('1', '2', '3', '4')
    tuple2 = 'one',                            #кортеж с одним элементом
    tuple3 = 'one', 'two', 'three'

    numbers = [0,1,2,3,4,5,6,7,8,9,10]
    numbers_tuple = tuple(numbers)             # кортеж из списка

    # распаковка кортежа
    a, b, c = tuple3

#-----------------------------------------------------
#-----------------------------------------------------
# множества
# не упорядочены
# элементы не повторяются
#-----------------------------------------------------
#-----------------------------------------------------
def SampleArrays():
    drinks = {'мартини' : {'водка', 'вермут'},
             'русская черная': {'водка', 'ликер'},
             'русская белая': {'сливки', 'водка', 'ликер'},
             'манхэттен': {'рожь', 'вермут', 'настотйка'},
             'отвертка': {'апельсиновый сок', 'водка'}}

    numbers = [0,1,2,3,4,5,6,7,8,9,10]
    numbers_set = set(numbers)
    
    # где есть водка?
    for name, contens in drinks.items():
        if('водка') in contens:
            print(name)
    print('-'*50)
    
    # где есть водка без вермута и сливок?
    for name, contens in drinks.items():
        if('водка') in contens and not ('вермут' in contens or 'сливки' in contens):
            print(name)
    print('-'*50)

    # где есть 'вермут' или 'апельсиновый сок' ?  (& - оператор пересечения множеств)
    for name, contens in drinks.items():
        if contens & {'вермут', 'апельсиновый сок'}:
            print(name)
    print('-'*50)

     # где есть водка без вермута и сливок?
    for name, contens in drinks.items():
        if('водка') in contens and not contens & {'вермут', 'сливки'}:
            print(name)
    print('-'*50)

#SampleLists()
SampleArrays()
